from res import *
from test import more_clauses


def clause_extraction():
    # Для формулы: (Римлянин(Марк) ∧ Диктатор(Цезарь) ∧
    # ∀x∀y (Римлянин(x) ∧ Диктатор(y) ∧ Ненавидит(x,y) → ПытаетсяУбить(x,y)) ∧
    # ∀x∀y (Римлянин(x) ∧ Диктатор(y) → (Предан(x,y) ∨ Ненавидит(x,y))) ∧
    # ¬Предан(Марк,Цезарь)) → ПытаетсяУбить(Марк,Цезарь)

    # После преобразований получаем клаузы:
    return [
        #[('Римлянин', ('x',)), ('not', ('Римлянин', ('x',)))],   # проверка тавтологий
        #[('not',('Римлянин', ('x',)))],   # проверка наддизъюнктов

        [('Римлянин', ('Марк',))],  # Римлянин(Марк)
        [('Диктатор', ('Цезарь',))],  # Диктатор(Цезарь)
        [('not', ('Римлянин', ('x',))), ('not', ('Диктатор', ('y',))), ('not', ('Ненавидит', ('x', 'y'))),
         ('ПытаетсяУбить', ('x', 'y'))],  # ¬Римлянин(x) ∨ ¬Диктатор(y) ∨ ¬Ненавидит(x,y) ∨ ПытаетсяУбить(x,y)
        [('not', ('Римлянин', ('x',))), ('not', ('Диктатор', ('y',))), ('Предан', ('x', 'y')),
         ('Ненавидит', ('x', 'y'))],  # ¬Римлянин(x) ∨ ¬Диктатор(y) ∨ Предан(x,y) ∨ Ненавидит(x,y)
        [('not', ('Предан', ('Марк', 'Цезарь')))],  # ¬Предан(Марк,Цезарь)
        [('not', ('ПытаетсяУбить', ('Марк', 'Цезарь')))]  # ¬ПытаетсяУбить(Марк,Цезарь)
    ]

    '''
    # Для формулы: (Человек{Сократ} and (Человек{x} -> Смертен{x})) -> Смертен{Сократ}
    # После преобразований получаем: Человек{Сократ} ∧ (¬Человек{x} ∨ Смертен{x}) ∧ ¬Смертен{Сократ}

    return [
        [('Человек', ('Сократ',))],  # Человек{Сократ}
        [('not', ('Человек', ('x',))), ('Смертен', ('x',))],  # ¬Человек{x} ∨ Смертен{x}
        [('not', ('Смертен', ('Сократ',)))]  # ¬Смертен{Сократ}
    ]
    '''


if __name__ == "__main__":
    clauses = clause_extraction()
    # clauses = more_clauses()   # тест на 100 резольвент
    prove(clauses)
